app/controllers/todos_controller.rb

  def index
    @status = params[:status].presence_in(%w[all pending completed]) || "all"
    @todos = current_user.todos

    case @status
    when "pending"
      @todos = current_user.todos.where(completed: false).or(current_user.todos.where(completed: nil))
    when "completed"
      @todos = current_user.todos.where(completed: true)
    end

    @todos = @todos.order(created_at: :desc)
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 1 ORDER BY "todos"."created_at" DESC

  def create
    @todo = current_user.todos.build(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("title", "description", "completed", "user_id", "created_at", "updated_at") VALUES ('Hi', '', TRUE, 1, '2026-10-04 20:32:18.609940', '2026-10-04 20:32:18.609940') RETURNING "id"